{
  "peft_type": "LORA",
  "base_model_name_or_path": "mlx-community/gemma-4-e4b-it-4bit",
  "r": 6,
  "lora_alpha": 6.0,
  "target_modules": [
    "q_proj"
  ],
  "bias": "none",
  "lora_dropout": 0.0,
  "fan_in_fan_out": false,
  "modules_to_save": null,
  "task_type": "CAUSAL_LM",
  "pierre_metadata": {
    "construction": "qr",
    "property": "orthonormal_rows",
    "rank": 6,
    "scale": 6.0,
    "verified_max_deviation": 2.384185791015625e-07,
    "grassmannian_tolerance": 1e-06
  }
}